RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_dma_ex.h
  DMA_RepeatBlockConfTypeDef  RepeatBlockConfig;  /*!< Specifies the DMA channel repeated block configuration         */

  uint32_t                    SrcAddress;         /*!< Specifies the source memory address                            */
  uint32_t                    DstAddress;         /*!< Specifies the destination memory address                       */
  uint32_t                    DataSize;           /*!< Specifies the source data size in bytes                        */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  uint32_t                    SrcSecure;          /*!< Specifies the source security attribute                        */
  uint32_t                    DestSecure;         /*!< Specifies the destination security attribute                   */
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

} DMA_NodeConfTypeDef;

/**
  * @brief  DMAEx Linked-List Node Structure Definition.
  */
typedef struct
{
  uint32_t LinkRegisters[8U]; /*!< Physical Node register description */
  uint32_t NodeInfo;          /*!< Node information                   */

} DMA_NodeTypeDef;

/**
  * @brief DMAEx Linked-List Queue Structure Definition.
  */
typedef struct __DMA_QListTypeDef
{
  DMA_NodeTypeDef                *Head;              /*!< Specifies the queue head node                    */

  DMA_NodeTypeDef                *FirstCircularNode; /*!< Specifies the queue first circular node          */

  uint32_t                       NodeNumber;         /*!< Specifies the queue node number                  */

  __IO HAL_DMA_QStateTypeDef     State;              /*!< Specifies the queue state                        */

  __IO uint32_t                  ErrorCode;          /*!< Specifies the queue error code                   */

  __IO uint32_t                  Type;               /*!< Specifies whether the queue is static or dynamic */

} DMA_QListTypeDef;
/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup DMAEx_Exported_Constants DMAEx Exported Constants
  * @brief    DMAEx Exported Constants
  * @{
  */

/** @defgroup Queue_Error_Codes Queue Error Codes
  * @brief    Queue Error Codes
  * @{
  */
#define HAL_DMA_QUEUE_ERROR_NONE        (0x00U) /*!< No error                                                */
#define HAL_DMA_QUEUE_ERROR_BUSY        (0x01U) /*!< Error busy                                              */
#define HAL_DMA_QUEUE_ERROR_EMPTY       (0x02U) /*!< Error unallowed operation for empty queue               */
#define HAL_DMA_QUEUE_ERROR_UNSUPPORTED (0x03U) /*!< Error unsupported feature                               */
#define HAL_DMA_QUEUE_ERROR_INVALIDTYPE (0x04U) /*!< Error incompatible node type or circular initialization
                                                     and queue circular types are incompatible               */
#define HAL_DMA_QUEUE_ERROR_OUTOFRANGE  (0x05U) /*!< Error out of range node memory                          */
#define HAL_DMA_QUEUE_ERROR_NOTFOUND    (0x06U) /*!< Error node not found in queue                           */
/**
  * @}
  */

/** @defgroup DMAEx_LinkedList_Mode DMAEx LinkedList Mode
  * @brief    DMAEx LinkedList Mode
  * @{
  */
#define DMA_LINKEDLIST_NORMAL   DMA_LINKEDLIST             /*!< Linear linked-list DMA channel transfer   */
#define DMA_LINKEDLIST_CIRCULAR (DMA_LINKEDLIST | (0x01U)) /*!< Circular linked-list DMA channel transfer */
/**
  * @}
  */

/** @defgroup DMAEx_Data_Alignment DMAEx Data Alignment
  * @brief    DMAEx Data Alignment
  * @{
  */
#define DMA_DATA_RIGHTALIGN_ZEROPADDED 0x00000000U    /*!< If source data width < destination data width
                                                           => Right aligned padded with 0 up to destination data
                                                              width                                              */
#define DMA_DATA_RIGHTALIGN_LEFTTRUNC  0x00000000U    /*!< If source data width > destination data width
                                                           => Right aligned left Truncated down to destination
                                                              data width                                         */
#define DMA_DATA_RIGHTALIGN_SIGNEXT    DMA_CTR1_PAM_0 /*!< If source data width < destination data width
                                                           => Right Aligned padded with sign extended up to
                                                              destination data width                             */
#define DMA_DATA_LEFTALIGN_RIGHTTRUNC  DMA_CTR1_PAM_0 /*!< If source data width > destination data width
                                                           => Left Aligned Right Truncated down to the
                                                              destination data width                             */
#define DMA_DATA_PACK                  DMA_CTR1_PAM_1 /*!< If source data width < destination data width
                                                           => Packed at the destination data width
                                                              (Available only for GPDMA)                         */
#define DMA_DATA_UNPACK                DMA_CTR1_PAM_1 /*!< If source data width > destination data width
                                                           => Unpacked at the destination data width
                                                              (Available only for GPDMA)                         */
/**
  * @}
  */

/** @defgroup DMAEx_Data_Exchange DMAEx Data Exchange
  * @brief    DMAEx Data Exchange
  * @{
  */
#define DMA_EXCHANGE_NONE          0x00000000U  /*!< No data exchange                                                          */
#define DMA_EXCHANGE_DEST_BYTE     DMA_CTR1_DBX /*!< Destination Byte exchange when destination data width is > Byte           */
#define DMA_EXCHANGE_DEST_HALFWORD DMA_CTR1_DHX /*!< Destination Half-Word exchange when destination data width is > Half-Word */
#define DMA_EXCHANGE_SRC_BYTE      DMA_CTR1_SBX /*!< Source Byte endianness exchange when source data width is word            */
/**
  * @}
  */

/** @defgroup DMAEx_Trigger_Polarity DMAEx Trigger Polarity
  * @brief    DMAEx Trigger Polarity
  * @{
  */
#define DMA_TRIG_POLARITY_MASKED  0x00000000U        /*!< No trigger of the selected DMA request. Masked trigger event                                */
#define DMA_TRIG_POLARITY_RISING  DMA_CTR2_TRIGPOL_0 /*!< Trigger of the selected DMA request on the rising edge of the selected trigger event input  */
#define DMA_TRIG_POLARITY_FALLING DMA_CTR2_TRIGPOL_1 /*!< Trigger of the selected DMA request on the falling edge of the selected trigger event input */
/**
  * @}
  */

/** @defgroup DMAEx_Trigger_Mode DMAEx Trigger Mode
  * @brief    DMAEx Trigger Mode
  * @{
  */
#define DMA_TRIGM_BLOCK_TRANSFER          0x00000000U      /*!< A block transfer is conditioned by (at least) one hit trigger          */
#define DMA_TRIGM_REPEATED_BLOCK_TRANSFER DMA_CTR2_TRIGM_0 /*!< A repeated block transfer is conditioned by (at least) one hit trigger */
#define DMA_TRIGM_LLI_LINK_TRANSFER       DMA_CTR2_TRIGM_1 /*!< A LLI link transfer is conditioned by (at least) one hit trigger       */
#define DMA_TRIGM_SINGLE_BURST_TRANSFER   DMA_CTR2_TRIGM   /*!< A single/burst transfer is conditioned by (at least) one hit trigger   */
/**
  * @}
  */

/** @defgroup DMAEx_Trigger_Selection DMAEx Trigger Selection
  * @brief    DMAEx Trigger Selection
  * @{
  */
/* GPDMA1 triggers */
#define GPDMA1_TRIGGER_EXTI_LINE0      (0U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE0      */
#define GPDMA1_TRIGGER_EXTI_LINE1      (1U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE1      */
#define GPDMA1_TRIGGER_EXTI_LINE2      (2U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE2      */
#define GPDMA1_TRIGGER_EXTI_LINE3      (3U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE3      */
#define GPDMA1_TRIGGER_EXTI_LINE4      (4U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE4      */
#define GPDMA1_TRIGGER_EXTI_LINE5      (5U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE5      */
#define GPDMA1_TRIGGER_EXTI_LINE6      (6U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE6      */
#define GPDMA1_TRIGGER_EXTI_LINE7      (7U)  /*!< GPDMA1 HW Trigger signal is EXTI_LINE7      */
#define GPDMA1_TRIGGER_TAMP_TRG1       (8U)  /*!< GPDMA1 HW Trigger signal is TAMP_TRG1       */
#define GPDMA1_TRIGGER_TAMP_TRG2       (9U)  /*!< GPDMA1 HW Trigger signal is TAMP_TRG2       */
#define GPDMA1_TRIGGER_TAMP_TRG3       (10U) /*!< GPDMA1 HW Trigger signal is TAMP_TRG3       */
#define GPDMA1_TRIGGER_LPTIM1_CH1      (11U) /*!< GPDMA1 HW Trigger signal is LPTIM1_CH1      */
#define GPDMA1_TRIGGER_LPTIM1_CH2      (12U) /*!< GPDMA1 HW Trigger signal is LPTIM1_CH2      */
#define GPDMA1_TRIGGER_LPTIM2_CH1      (13U) /*!< GPDMA1 HW Trigger signal is LPTIM2_CH1      */
#define GPDMA1_TRIGGER_LPTIM2_CH2      (14U) /*!< GPDMA1 HW Trigger signal is LPTIM2_CH2      */
#define GPDMA1_TRIGGER_LPTIM4_OUT      (15U) /*!< GPDMA1 HW Trigger signal is LPTIM4_OUT      */
#define GPDMA1_TRIGGER_COMP1_OUT       (16U) /*!< GPDMA1 HW Trigger signal is COMP1_OUT       */
#define GPDMA1_TRIGGER_COMP2_OUT       (17U) /*!< GPDMA1 HW Trigger signal is COMP2_OUT       */
#define GPDMA1_TRIGGER_RTC_ALRA_TRG    (18U) /*!< GPDMA1 HW Trigger signal is RTC_ALRA_TRG    */
#define GPDMA1_TRIGGER_RTC_ALRB_TRG    (19U) /*!< GPDMA1 HW Trigger signal is RTC_ALRB_TRG    */
#define GPDMA1_TRIGGER_RTC_WUT_TRG     (20U) /*!< GPDMA1 HW Trigger signal is RTC_WUT_TRG     */
#define GPDMA1_TRIGGER_GPDMA1_CH0_TCF  (22U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH0_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH1_TCF  (23U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH1_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH2_TCF  (24U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH2_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH3_TCF  (25U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH3_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH4_TCF  (26U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH4_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH5_TCF  (27U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH5_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH6_TCF  (28U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH6_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH7_TCF  (29U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH7_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH8_TCF  (30U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH8_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH9_TCF  (31U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH9_TCF  */
#define GPDMA1_TRIGGER_GPDMA1_CH10_TCF (32U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH10_TCF */
#define GPDMA1_TRIGGER_GPDMA1_CH11_TCF (33U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH11_TCF */
#define GPDMA1_TRIGGER_GPDMA1_CH12_TCF (34U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH12_TCF */
#define GPDMA1_TRIGGER_GPDMA1_CH13_TCF (35U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH13_TCF */
#define GPDMA1_TRIGGER_GPDMA1_CH14_TCF (36U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH14_TCF */
#define GPDMA1_TRIGGER_GPDMA1_CH15_TCF (37U) /*!< GPDMA1 HW Trigger signal is GPDMA1_CH15_TCF */
#define GPDMA1_TRIGGER_LPDMA1_CH0_TCF  (38U) /*!< GPDMA1 HW Trigger signal is LPDMA1_CH0_TCF  */
#define GPDMA1_TRIGGER_LPDMA1_CH1_TCF  (39U) /*!< GPDMA1 HW Trigger signal is LPDMA1_CH1_TCF  */
#define GPDMA1_TRIGGER_LPDMA1_CH2_TCF  (40U) /*!< GPDMA1 HW Trigger signal is LPDMA1_CH2_TCF  */
#define GPDMA1_TRIGGER_LPDMA1_CH3_TCF  (41U) /*!< GPDMA1 HW Trigger signal is LPDMA1_CH3_TCF  */
#define GPDMA1_TRIGGER_TIM2_TRGO       (42U) /*!< GPDMA1 HW Trigger signal is TIM2_TRGO       */
#define GPDMA1_TRIGGER_TIM15_TRGO      (43U) /*!< GPDMA1 HW Trigger signal is TIM15_TRGO      */
#define GPDMA1_TRIGGER_ADC4_AWD1       (57U) /*!< GPDMA1 HW Trigger signal is ADC4_AWD1       */
#define GPDMA1_TRIGGER_ADC1_AWD1       (58U) /*!< GPDMA1 HW Trigger signal is ADC1_AWD1       */

/* LPDMA1 triggers */
#define LPDMA1_TRIGGER_EXTI_LINE0      (0U)  /*!< LPDMA1 HW Trigger signal is EXTI_LINE0      */
#define LPDMA1_TRIGGER_EXTI_LINE1      (1U)  /*!< LPDMA1 HW Trigger signal is EXTI_LINE1      */
#define LPDMA1_TRIGGER_EXTI_LINE2      (2U)  /*!< LPDMA1 HW Trigger signal is EXTI_LINE2      */
#define LPDMA1_TRIGGER_EXTI_LINE3      (3U)  /*!< LPDMA1 HW Trigger signal is EXTI_LINE3      */
#define LPDMA1_TRIGGER_EXTI_LINE4      (4U)  /*!< LPDMA1 HW Trigger signal is EXTI_LINE4      */
#define LPDMA1_TRIGGER_TAMP_TRG1       (5U)  /*!< LPDMA1 HW Trigger signal is TAMP_TRG1       */
#define LPDMA1_TRIGGER_TAMP_TRG2       (6U)  /*!< LPDMA1 HW Trigger signal is TAMP_TRG2       */
#define LPDMA1_TRIGGER_TAMP_TRG3       (7U)  /*!< LPDMA1 HW Trigger signal is TAMP_TRG3       */
#define LPDMA1_TRIGGER_LPTIM1_CH1      (8U)  /*!< LPDMA1 HW Trigger signal is LPTIM1_CH1      */
#define LPDMA1_TRIGGER_LPTIM1_CH2      (9U)  /*!< LPDMA1 HW Trigger signal is LPTIM1_CH2      */
#define LPDMA1_TRIGGER_LPTIM3_CH1      (10U) /*!< LPDMA1 HW Trigger signal is LPTIM3_CH1      */
#define LPDMA1_TRIGGER_LPTIM4_OUT      (11U) /*!< LPDMA1 HW Trigger signal is LPTIM4_OUT      */
#define LPDMA1_TRIGGER_COMP1_OUT       (12U) /*!< LPDMA1 HW Trigger signal is COMP1_OUT       */
#define LPDMA1_TRIGGER_COMP2_OUT       (13U) /*!< LPDMA1 HW Trigger signal is COMP2_OUT       */
#define LPDMA1_TRIGGER_RTC_ALRA_TRG    (14U) /*!< LPDMA1 HW Trigger signal is RTC_ALRA_TRG    */
#define LPDMA1_TRIGGER_RTC_ALRB_TRG    (15U) /*!< LPDMA1 HW Trigger signal is RTC_ALRB_TRG    */
#define LPDMA1_TRIGGER_RTC_WUT_TRG     (16U) /*!< LPDMA1 HW Trigger signal is RTC_WUT_TRG     */
#define LPDMA1_TRIGGER_ADC4_AWD1       (17U) /*!< LPDMA1 HW Trigger signal is ADC4_AWD1       */
#define LPDMA1_TRIGGER_LPDMA1_CH0_TCF  (18U) /*!< LPDMA1 HW Trigger signal is LPDMA1_CH0_TCF  */
#define LPDMA1_TRIGGER_LPDMA1_CH1_TCF  (19U) /*!< LPDMA1 HW Trigger signal is LPDMA1_CH1_TCF  */
#define LPDMA1_TRIGGER_LPDMA1_CH2_TCF  (20U) /*!< LPDMA1 HW Trigger signal is LPDMA1_CH2_TCF  */
#define LPDMA1_TRIGGER_LPDMA1_CH3_TCF  (21U) /*!< LPDMA1 HW Trigger signal is LPDMA1_CH3_TCF  */
#define LPDMA1_TRIGGER_GPDMA1_CH0_TCF  (22U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH0_TCF  */
#define LPDMA1_TRIGGER_GPDMA1_CH1_TCF  (23U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH1_TCF  */
#define LPDMA1_TRIGGER_GPDMA1_CH4_TCF  (24U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH4_TCF  */
#define LPDMA1_TRIGGER_GPDMA1_CH5_TCF  (25U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH5_TCF  */
#define LPDMA1_TRIGGER_GPDMA1_CH6_TCF  (26U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH6_TCF  */
#define LPDMA1_TRIGGER_GPDMA1_CH7_TCF  (27U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH7_TCF  */
#define LPDMA1_TRIGGER_GPDMA1_CH12_TCF (28U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH12_TCF */
#define LPDMA1_TRIGGER_GPDMA1_CH13_TCF (29U) /*!< LPDMA1 HW Trigger signal is GPDMA1_CH13_TCF */
#define LPDMA1_TRIGGER_TIM2_TRGO       (30U) /*!< LPDMA1 HW Trigger signal is TIM2_TRGO       */
#define LPDMA1_TRIGGER_TIM15_TRGO      (31U) /*!< LPDMA1 HW Trigger signal is TIM15_TRGO      */
/**
  * @}
  */

/** @defgroup DMAEx_Node_Type DMAEx Node Type
  * @brief    DMAEx Node Type
  * @{
  */
#define DMA_LPDMA_LINEAR_NODE (DMA_CHANNEL_TYPE_LPDMA | DMA_CHANNEL_TYPE_LINEAR_ADDR) /*!< Defines the LPDMA linear addressing node type      */
#define DMA_GPDMA_LINEAR_NODE (DMA_CHANNEL_TYPE_GPDMA | DMA_CHANNEL_TYPE_LINEAR_ADDR) /*!< Defines the GPDMA linear addressing node type      */
#define DMA_GPDMA_2D_NODE     (DMA_CHANNEL_TYPE_GPDMA | DMA_CHANNEL_TYPE_2D_ADDR)     /*!< Defines the GPDMA 2 dimension addressing node type */
/**
  * @}
  */

/** @defgroup DMAEx_Link_Allocated_Port DMAEx Linked-List Allocated Port
  * @brief    DMAEx Linked-List Allocated Port
  * @{
  */
#define DMA_LINK_ALLOCATED_PORT0 0x00000000U /*!< Link allocated port 0 */
#define DMA_LINK_ALLOCATED_PORT1 DMA_CCR_LAP /*!< Link allocated port 1 */
/**
  * @}
  */

/** @defgroup DMAEx_Link_Step_Mode DMAEx Link Step Mode
  * @brief    DMAEx Link Step Mode
  * @{
  */
#define DMA_LSM_FULL_EXECUTION  0x00000000U /*!< Channel is executed for the full linked-list */
#define DMA_LSM_1LINK_EXECUTION DMA_CCR_LSM /*!< Channel is executed once for the current LLI */
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup DMAEx_Exported_Functions DMAEx Exported Functions
  * @brief    DMAEx Exported functions
  * @{
  */

/** @defgroup DMAEx_Exported_Functions_Group1 Linked-List Initialization and De-Initialization Functions
  * @brief    Linked-List Initialization and De-Initialization Functions
  * @{
  */
HAL_StatusTypeDef HAL_DMAEx_List_Init(DMA_HandleTypeDef *const hdma);
HAL_StatusTypeDef HAL_DMAEx_List_DeInit(DMA_HandleTypeDef *const hdma);
/**
  * @}
  */

/** @defgroup DMAEx_Exported_Functions_Group2 Linked-List I/O Operation Functions
  * @brief    Linked-List I/O Operation Functions
  * @{
  */
HAL_StatusTypeDef HAL_DMAEx_List_Start(DMA_HandleTypeDef *const hdma);
HAL_StatusTypeDef HAL_DMAEx_List_Start_IT(DMA_HandleTypeDef *const hdma);
/**
  * @}
  */

